# EfficientDet-D0 Pipeline Config — PPE Detection Task 1 (Helmet)
# Based on the TF Model Zoo efficientdet_d0_coco17_tpu-32 config.
# Fields marked <<<PATCH>>> are overwritten by src/model.py:build_pipeline_config()

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 1  # <<<PATCH>>> by build_pipeline_config

    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 512
        max_dimension: 512
        pad_to_max_dimension: true
      }
    }

    feature_extractor {
      type: "ssd_efficientnet-b0_bifpn_keras"
      conv_hyperparams {
        regularizer { l2_regularizer { weight: 4e-5 } }
        initializer { truncated_normal_initializer { stddev: 0.03 mean: 0.0 } }
        activation: SWISH
        batch_norm {
          scale: true
          decay: 0.99
          epsilon: 0.001
        }
      }
      bifpn {
        min_level: 3
        max_level: 7
        num_iterations: 3
        num_filters: 64
      }
    }

    box_coder {
      faster_rcnn_box_coder {
        y_scale: 1.0
        x_scale: 1.0
        height_scale: 1.0
        width_scale: 1.0
      }
    }

    matcher { argmax_matcher {
      matched_threshold: 0.5
      unmatched_threshold: 0.5
      ignore_thresholds: false
      negatives_lower_than_unmatched: true
      force_match_for_each_row: true
      use_matmul_gather: true
    }}

    similarity_calculator { iou_similarity {} }

    encode_background_as_zeros: true
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer { l2_regularizer { weight: 4e-5 } }
          initializer { random_normal_initializer { stddev: 0.01 mean: 0.0 } }
          activation: SWISH
          batch_norm { scale: true decay: 0.99 epsilon: 0.001 }
        }
        depth: 64
        num_layers_before_predictor: 3
        kernel_size: 3
        class_prediction_bias_init: -4.6
        use_depthwise: true
      }
    }

    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: [1.0, 2.0, 0.5]
        scales_per_octave: 3
      }
    }

    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.01
        iou_threshold: 0.5
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }

    normalize_loss_by_num_matches: true
    loss {
      localization_loss { weighted_smooth_l1 {} }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 1.5
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}

train_config {
  batch_size: 4  # <<<PATCH>>>
  data_augmentation_options { random_horizontal_flip {} }
  data_augmentation_options {
    random_scale_crop_and_pad_to_square {
      output_size: 512
      scale_min: 0.1
      scale_max: 2.0
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.04
          total_steps: 2000  # <<<PATCH>>>
          warmup_learning_rate: 0.0001
          warmup_steps: 100
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "PATH_TO_CHECKPOINT/ckpt-0"  # <<<PATCH>>>
  num_steps: 2000  # <<<PATCH>>>
  startup_delay_steps: 0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"  # <<<PATCH>>>
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}

train_input_reader {
  label_map_path: "PATH_TO_LABEL_MAP"  # <<<PATCH>>>
  tf_record_input_reader {
    input_path: "PATH_TO_TRAIN_TFRECORD"  # <<<PATCH>>> # train
  }
}

eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  batch_size: 1
}

eval_input_reader {
  label_map_path: "PATH_TO_LABEL_MAP"  # <<<PATCH>>>
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "PATH_TO_VAL_TFRECORD"  # <<<PATCH>>> # val
  }
}
